'''
Задание 1

Поработайте с переменными, создайте несколько, выведите на экран, запросите у пользователя несколько чисел и строк и сохраните в переменные, выведите на экран.
'''

var1 = 1
var2 = 2
var3 = 3
print(
    f'Сохранённые переменные равны: первая переменная - {var1}, вторая переменная - {var2}, третья переменная - {var3}')

name = input('Пожалуйста, введите Ваше имя: ')
in1 = input('Пожалуйста, введите первое число: ')
in2 = input('Пожалуйста, введите второе число: ')

print(
    f'Уважаемый(ая) {name}! Вы ввели числа {in1} и {in2} соттветственно!')