'''
Задание 4

Представлен список чисел. Определить элементы списка, не имеющие повторений.
Сформировать итоговый массив чисел, соответствующих требованию. Элементы вывести в порядке их следования в исходном списке.
Для выполнения задания обязательно использовать генератор.
Пример исходного списка: [2, 2, 2, 7, 23, 1, 44, 44, 3, 2, 10, 7, 4, 11].
Результат: [23, 1, 3, 10, 4, 11]
'''
import random as r

arr1 = [r.randint(1, 1000) for i in range(20)]
arr2 = [i for i in arr1 if arr1.count(i) < 2]
print(f'Первоначальный список: {arr1}')
print(f'Новый список: {arr2}')
